[
	{
		"id": "morbent-manor",
		"name": "Morbent Manor",
		"date": "06-2023",
		"tags": ["C#", "Unity"],
		"overview": "Ambitious roguelike built in Unity",
		"imageUrl": "morbent-manor.png",
		"description": "Morbent Manor is a dungeon-crawling roguelike that I built in Unity as part of my master's dissertation, achieving a first class grade of 80%. \n The game features procedurally generated levels, a variety of enemies, and explores a unique MOBA-style combat system. I also created and animated many custom assets using Aseprite and Unity's robust state machine system. \n The game is available to play as a demo on itch.io. If you would like to learn more about the game, read my dissertation or look at the source code, please feel free to contact me.",
		"buttons": [
			{ "text": "Play", "link": "https://jacksonl22.itch.io/morbent-manor" },
			{ "text": "Contact", "link": "#contact" }
		]
	},
	{
		"id": "kitchen-feud",
		"name": "Kitchen Feud",
		"date": "06-2022",
		"tags": ["C#", "Unity"],
		"overview": "Online team-based cooking game built in Unity",
		"imageUrl": "kf.jpg",
		"description": "Kitchen Feud is an online team-based cooking game built in Unity. Along with 5 other developers, we created this game during our 3rd year at University. \n Inspired by Overcooked, the game features a competitive cooking environment where players follow recipes to earn points, and are encouraged to sabotage the enemy kitchen to maximize their score. \n The full game is available to play using the demo link below, along with the source code and final report on GitHub.",
		"buttons": [
			{ "text": "Play", "link": "https://lokhei.github.io/kitchen_feud/" },
			{ "text": "GitHub", "link": "https://github.com/KaliKaloo/Kitchen-Feud" }
		]
	},
	{
		"id": "warcraft-portfolio",
		"name": "Warcraft Portfolio",
		"date": "08-2023",
		"tags": ["Svelte", "SvelteKit", "JavaScript", "TailwindCSS"],
		"overview": "Portfolio creation tool for World of Warcraft characters",
		"imageUrl": "warcraft-portfolio.png",
		"description": "Warcraft Portfolio helps players to create a portfolio for their World of Warcraft characters, to help streamline the process of applying to guilds and when reading applications. \n This tool aims to provide the most important and valuable information so recruiters don't need to trawl through many different websites to find the information they need. \n Built ontop of SvelteKit, the tool fetches data from WarcraftLogs and Raider.io's API.",
		"buttons": [
			{ "text": "Website", "link": "https://warcraft-portfolio.vercel.app" },
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/warcraft-portfolio" }
		]
	},
	{
		"id": "rendering-engine",
		"name": "C++ Rendering Engine",
		"date": "11-2021",
		"tags": ["C++", "SDL2", "GLM"],
		"overview": "Rendering engine built in C++ with SDL2 and GLM",
		"imageUrl": "i18.bmp",
		"description": "A rendering engine created from scratch using C++, with SDL2 for drawing to screen and GLM to assist with vector and matrix operations. \n The engine features some basic implementations of rendering techniques used by modern renderers including rasterization, ray tracing, phong shading and more.",
		"buttons": [{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/CG2021" }]
	},
	{
		"id": "sensitivty-converter",
		"name": "Sensitivity Converter",
		"date": "07-2023",
		"tags": ["React", "JavaScript"],
		"overview": "Tool to convert mouse sensitivity between games",
		"imageUrl": "sensitivity-converter.png",
		"description": "A tool to help users to convert their mouse sensitivity between different games. \n I've often found that the converters available have too many bells and whistles, making it confusing or frustrating to use when you just want to convert your mouse sensitivity. This tool focuses on offering an extremely simple interface built on React, to do the job as quickly and easily as possible.",
		"buttons": [
			{ "text": "Website", "link": "https://jacksonlawrence1.github.io/sensitivity-converter/" },
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/sensitivity-converter" }
		]
	},
	{
		"id": "letterboxd-rec",
		"name": "Letterboxd Rec",
		"tags": ["Go", "htmx"],
		"date": "06-2024",
		"overview": "Accurate Movie recommendations, built using Go",
		"imageUrl": "letterboxd-rec.png",
		"description": "Letterboxd Rec is a tool to help provide accurate movie recommendations based on Letterboxd favourites. \n When provided a single movie, the tool uses a web scraper to concurrently gather data from users who hold the movie highly, i.e. in their 'top 4' favourites. \n Built using a Go HTTP server, with htmx to perform AJAX requests, I wanted to explore the performance using a non-JavaScript framework for web development.",
		"buttons": [{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/letterboxd-rec" }]
	},
	{
		"id": "blender-farm",
		"name": "AWS Rendering Farm",
		"date": "11-2022",
		"tags": ["Python", "AWS"],
		"overview": "Rendering farm for Blender built with AWS",
		"imageUrl": "blender-farm.png",
		"description": "A tool to help speed up the process of rendering Blender projects using AWS instances. \n Using EC2 instances as workers, the tool splits work so blender files can be rendered distributively. Includes options to render portions of files, and even includes a 'chaos testing' mode to simulate how the tool perseveres through heavy failure/load.",
		"buttons": [
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/aws-blender-farm" }
		]
	},
	{
		"id": "graph-calculator",
		"name": "Graph Calculator",
		"date": "07-2019",
		"tags": ["Python", "Pygame"],
		"overview": "Desmos like graphing calculator",
		"imageUrl": "graph-calculator.png",
		"description": "A primitive graphing calculater built to help students visualise and understand the nature of mathematical functions. \n Inspired by Desmos, a web-based graphing visualiser, I created this as part of my Computer Science A-Levels. the tool allows users to input and quickly visualise a set of mathematical functions including polynomials, trigonometry and circles. \n I created the project with Python, along with Pygame to render the UI.",
		"buttons": [
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/GraphCalculatorProject" }
		]
	},
	{
		"id": "ale-trail",
		"name": "Ale Trail",
		"date": "06-2021",
		"tags": ["Android", "Kotlin"],
		"overview": "Pub crawl tracking app for Android devices",
		"imageUrl": "pilgrim.jpg",
		"description": "Ale Trail lets users track their progress during pub crawls and, once completed, win prizes. \n The app was created for a client as part of a group project alongside 4 other students during my 2nd date of University. Users scan a QR code to verify they have visited and can follow along using a map to track the locations of pubs on the trail. It also included an admin dashboard for user analytics. \n The app was built using Kotlin and Android Studio, with a MySQL databse for the backend. As the app was created for a client, the source code is not available, but if you would like to know more about the project, please feel free to contact me.",
		"buttons": [
			{ "text": "Video", "link": "https://www.youtube.com/watch?v=1zHG63kpoGY" },
			{ "text": "Contact", "link": "#contact" }
		]
	},
	{
		"id": "director-spectrum",
		"name": "Director Spectrum",
		"date": "05-2024",
		"tags": ["Svelte", "SvelteKit", "TypeScript"],
		"overview": "Showcase of different film director styles",
		"imageUrl": "director-spectrum.png",
		"description": "A website to showcases how film directors can fall into a spectrum of directing styles. \n Made as an effort to focus on front-end creativity, this small project allows users to view information about similar film directors and explore some of their filmography. \n Created using Svelte (with SvelteKit) and TypeScript.",
		"buttons": [
			{ "text": "Website", "link": "https://thedirectorspectrum.vercel.app" },
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/director-spectrum" }
		]
	},
	{
		"id": "rep-buddy",
		"name": "Rep Buddy",
		"date": "08-2024",
		"tags": ["React", "React Native", "TypeScript"],
		"overview": "Native Workout history and management app",
		"imageUrl": "rep-buddy.png",
		"description": "A native workout management app allowing users to track their workout history, creating templates of custom workouts and exercises. This includes the a detailed workout history with exercise weight used, and the number of reps completed. \n Built using React Native and TypeScript, I am aiming to release it soon for Android on the Google Play Store.",
		"buttons": [
			{ "text": "GitHub", "link": "https://github.com/JacksonLawrence1/rep-buddy" }
		]
	}
]
